xmlsamples/PI_MTCN/PH-FI-BIS-PHQ86.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:esp-fee-inquiry-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGBSPHQ8600T</id>
            <system>
               <id>WGBSPHQ8600T</id>
               <name>Cebuana</name>
               <version>9101</version>
               <ip_address>10.1.40.181</ip_address>
               <connector>
                  <id>PHQ86JP01</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>BL</id>
            <type>WALLET</type>
         </device>
         <transaction_type>WMN</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>100</principal_amount>
               <currency_iso_code>PHP</currency_iso_code>
               <country_iso_code>PH</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>0</expected_payout_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>US</country_iso_code>
               <state_code>CA</state_code>
               <city>San Jose</city>
            </destination>
         </payment_details>
      </ns2:esp-fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>